In [1]:
import numpy as np
import pandas as pd

In [2]:
from numpy.random import randn

In [3]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [4]:
df = pd.DataFrame(data)

In [5]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [24]:
numeric_df = df.select_dtypes(include=['number'])
byComp = df.groupby('Company')

In [25]:
byComp.apply(lambda x: x.select_dtypes(include=['number']).mean())

C:\Users\glori\AppData\Local\Temp\ipykernel_11696\897838499.py:1: DeprecationWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  byComp.apply(lambda x: x.select_dtypes(include=['number']).mean())

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [26]:
byComp.sum()

             Person  Sales
Company
FB        CarlSarah    593
GOOG     SamCharlie    320
MSFT     AmyVanessa    464

In [28]:
byComp.apply(lambda x: x.select_dtypes(include=['number']).std())

C:\Users\glori\AppData\Local\Temp\ipykernel_11696\3189997162.py:1: DeprecationWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  byComp.apply(lambda x: x.select_dtypes(include=['number']).std())

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [30]:
byComp.sum().loc['FB']

Person    CarlSarah
Sales           593
Name: FB, dtype: object

In [32]:
df.groupby('Company').min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [35]:
df.groupby('Company').describe().transpose()['FB']

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64